"use strict";

// •	Какое будет выведено значение: let x = 5; alert( x++ ); ?

//let x = 5; alert( x++ ); //5

// •	Чему равно такое выражение: [ ] + false - null + true ?

//console.log([ ] + false - null + true); //false правильный ответ NaN

// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?

//let y = 1; let x = y = 2; alert(x); //2

// •	Чему равна сумма [ ] + 1 + 2?

//console.log([ ] + 1 + 2); //string правильный ответ 12

// •	Что выведет этот код: alert( "1"[0] )?

//alert( "1"[0] ) //1

// •	Чему равно 2 && 1 && null && 0 && undefined ?

console.log(2 && 1 && null && 0 && undefined); //правильный ответ null



// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)?

// Да !! - булиан . 

// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ?

alert( null || 2 && 3 || 4 ); //null правильный ответ 3

// •	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?

    //да ответ нет так как это два разных ящика

// •	Что выведет этот код: alert( +"Infinity" ); ?

alert( +"Infinity" ); //числовой тип    

// •	Верно ли сравнение: "Ёжик" > "яблоко"?

//нет

// •	Чему равно 0 || "" || 2 || undefined || true || falsе ?

console.log(0 || "" || 2 || undefined || true || falsе); //До первого тру
